# Pandas 학습

1. 데이터 분석을 위한 모듈
    - 데이터 분석 및 가공에 사용되는 활용 빈도가 높은 library
    
    - Numpy 모듈 기반으로 생성된

## 학습 내용

1. 기초 익히기 
> 이미 존재하는 파일의 내용으로 DataFrame 생성하기 <br>
> 중복 데이터 제거 <br>
> 결측 시 처리

2. DataFrame 구조
> https://pandas.pydata.org/docs/getting_started/index.html

<img src="img/DataFrame.PNG" width= '50%'>

In [1]:
# 전처리를 위한 library import

import numpy as np
import pandas as pd

In [2]:
!pip show pandas

Name: pandas
Version: 1.0.1
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: numpy, pytz, python-dateutil
Required-by: statsmodels, seaborn

기초 익히기

In [3]:
# 시리즈  -  정수 값으로 생성 시 

s = pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [4]:
type(s)

pandas.core.series.Series

In [5]:
s.values

array([1, 2, 3], dtype=int64)

In [6]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
# 결측치 의미하는 표현

# 자바 - null / java script - undefined, NaN, sql - null(blank), python - NaN

#Python에서 결측치 구성하는 API - np.nan

#결측치가 포함된 데이터 값은 정수 데이터들이라 해도 float64로 변경
s= pd.Series([1,np.nan, 3])

s

0    1.0
1    NaN
2    3.0
dtype: float64

In [8]:
# 결측치는 false로 간주 따라서 데이터 개수 counting 시에 skip

s.count()

2

In [9]:
# 존재하는 row 수만큼 cout를 해야 하는 상황이라 가정

# 해결책 : 결측치값을 유효한 데이터로 변경

# 0으로 변경 차후 데이터가 다양해지면, 평균, 중앙값 ..

s.fillna(0)
s

0    1.0
1    NaN
2    3.0
dtype: float64

In [10]:
s = s.fillna(0) # 대입

s

0    1.0
1    0.0
2    3.0
dtype: float64

In [11]:
s= pd.Series([1,np.nan, 3])
s

0    1.0
1    NaN
2    3.0
dtype: float64

In [12]:
#결측지 자체를 삭hint - 존재하는 table 삭제?) 원본 자체X 결측지 자체를 삭제 (hint 존재하는 table 삭제 명령어) 

#원본 자체의 구조 수정된 상태로 복제(fillna(): 복제본 생성)
s.dropna()

s

0    1.0
1    NaN
2    3.0
dtype: float64

특정 날짜를 기준으로 자동 날짜 증가해서 DataFrame 생성

In [13]:
datas = pd.date_range('20200915', periods = 6)

datas

DatetimeIndex(['2020-09-15', '2020-09-16', '2020-09-17', '2020-09-18',
               '2020-09-19', '2020-09-20'],
              dtype='datetime64[ns]', freq='D')

In [14]:
# 난수 발생 API

# 정수? 실수?

np.random.randint(13)

3

In [15]:
np.random.randn(2,3)

array([[ 0.66528729,  1.53858049, -0.46584434],
       [ 0.79423315, -2.43519045,  0.15013365]])

In [16]:
df = pd.DataFrame(np.random.randn(6,4))

df

          0         1         2         3
0 -0.134406 -0.870028 -0.444902  0.316522
1 -1.209856  0.626749 -1.452924  0.396792
2 -0.348878 -0.432869 -0.351119 -1.336529
3  0.271219 -0.508122 -0.673506  0.314119
4 -0.223473  0.795913 -1.091460  0.655110
5  0.592402 -0.746993 -0.449162 -0.281426

In [17]:
# index를 사용자 정의 표현식으로 가공

df = pd.DataFrame(np.random.randn(6,4), index=datas)

df

                   0         1         2         3
2020-09-15 -0.326811 -0.852217  1.960548  0.623058
2020-09-16  1.963427 -0.827086  1.342391 -0.280311
2020-09-17  0.340410  0.187964 -0.048103 -1.130387
2020-09-18  1.591654  0.103855  0.439527  1.107312
2020-09-19 -1.898574 -0.354861 -0.315721  2.749160
2020-09-20  2.354824  1.086232  0.193916 -0.398517

In [18]:
# 컬럼 가공

df = pd.DataFrame(np.random.randn(6,4), index=datas, columns=['A','B','C','D'])

df

                   A         B         C         D
2020-09-15 -0.101100 -0.566769  1.338602 -0.729187
2020-09-16  0.793045  0.526989  0.194956 -1.353654
2020-09-17  1.890562  0.975485  0.303967  0.261831
2020-09-18 -0.322551  0.756119 -0.592289 -1.676248
2020-09-19  0.654654  0.274811 -0.888663 -2.792851
2020-09-20 -1.564976 -0.808252 -1.424122 -0.499903

In [19]:
df.values

array([[-0.1011003 , -0.5667686 ,  1.33860182, -0.72918669],
       [ 0.79304488,  0.5269895 ,  0.1949555 , -1.35365423],
       [ 1.89056155,  0.97548459,  0.30396721,  0.26183099],
       [-0.32255089,  0.75611886, -0.59228882, -1.67624814],
       [ 0.65465431,  0.27481095, -0.88866261, -2.79285056],
       [-1.56497613, -0.80825154, -1.42412173, -0.49990329]])

In [20]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.index

DatetimeIndex(['2020-09-15', '2020-09-16', '2020-09-17', '2020-09-18',
               '2020-09-19', '2020-09-20'],
              dtype='datetime64[ns]', freq='D')

In [22]:
#DataFrame의 구조 확인하는 함수

df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2020-09-15 to 2020-09-20
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [23]:
# 대략적인 데이터 분포 확인 함수(기초 통계 함수)

df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.224939  0.193064 -0.177925 -1.131669
std    1.174014  0.724897  0.990047  1.059087
min   -1.564976 -0.808252 -1.424122 -2.792851
25%   -0.267188 -0.356374 -0.814569 -1.595600
50%    0.276777  0.400900 -0.198667 -1.041420
75%    0.758447  0.698837  0.276714 -0.557224
max    1.890562  0.975485  1.338602  0.261831

In [24]:
df

                   A         B         C         D
2020-09-15 -0.101100 -0.566769  1.338602 -0.729187
2020-09-16  0.793045  0.526989  0.194956 -1.353654
2020-09-17  1.890562  0.975485  0.303967  0.261831
2020-09-18 -0.322551  0.756119 -0.592289 -1.676248
2020-09-19  0.654654  0.274811 -0.888663 -2.792851
2020-09-20 -1.564976 -0.808252 -1.424122 -0.499903

In [25]:
#ascending=True 오름차순
#ascending=False 내림차순

df.sort_values(by='B', ascending=True)

                   A         B         C         D
2020-09-20 -1.564976 -0.808252 -1.424122 -0.499903
2020-09-15 -0.101100 -0.566769  1.338602 -0.729187
2020-09-19  0.654654  0.274811 -0.888663 -2.792851
2020-09-16  0.793045  0.526989  0.194956 -1.353654
2020-09-18 -0.322551  0.756119 -0.592289 -1.676248
2020-09-17  1.890562  0.975485  0.303967  0.261831

In [26]:
df['A']

2020-09-15   -0.101100
2020-09-16    0.793045
2020-09-17    1.890562
2020-09-18   -0.322551
2020-09-19    0.654654
2020-09-20   -1.564976
Freq: D, Name: A, dtype: float64

In [27]:
df.A

2020-09-15   -0.101100
2020-09-16    0.793045
2020-09-17    1.890562
2020-09-18   -0.322551
2020-09-19    0.654654
2020-09-20   -1.564976
Freq: D, Name: A, dtype: float64

In [28]:
#A와 B 컬럼 값 확인

df[['A','B']]

                   A         B
2020-09-15 -0.101100 -0.566769
2020-09-16  0.793045  0.526989
2020-09-17  1.890562  0.975485
2020-09-18 -0.322551  0.756119
2020-09-19  0.654654  0.274811
2020-09-20 -1.564976 -0.808252

In [29]:
df['2020-09-15':'2020-09-19']

                   A         B         C         D
2020-09-15 -0.101100 -0.566769  1.338602 -0.729187
2020-09-16  0.793045  0.526989  0.194956 -1.353654
2020-09-17  1.890562  0.975485  0.303967  0.261831
2020-09-18 -0.322551  0.756119 -0.592289 -1.676248
2020-09-19  0.654654  0.274811 -0.888663 -2.792851

In [30]:
# index 값을 기준으로 발췌 [시작점:끝점 - 1]

df[0:4]

                   A         B         C         D
2020-09-15 -0.101100 -0.566769  1.338602 -0.729187
2020-09-16  0.793045  0.526989  0.194956 -1.353654
2020-09-17  1.890562  0.975485  0.303967  0.261831
2020-09-18 -0.322551  0.756119 -0.592289 -1.676248

In [31]:
df

                   A         B         C         D
2020-09-15 -0.101100 -0.566769  1.338602 -0.729187
2020-09-16  0.793045  0.526989  0.194956 -1.353654
2020-09-17  1.890562  0.975485  0.303967  0.261831
2020-09-18 -0.322551  0.756119 -0.592289 -1.676248
2020-09-19  0.654654  0.274811 -0.888663 -2.792851
2020-09-20 -1.564976 -0.808252 -1.424122 -0.499903

loc 속성

    -데이터들을 slicing 하는 기술

    - loc[index, columns]

In [32]:
df.loc[:,['A','B']]

                   A         B
2020-09-15 -0.101100 -0.566769
2020-09-16  0.793045  0.526989
2020-09-17  1.890562  0.975485
2020-09-18 -0.322551  0.756119
2020-09-19  0.654654  0.274811
2020-09-20 -1.564976 -0.808252

In [33]:
df.loc['2020-09-16',['A','B']]

A    0.793045
B    0.526989
Name: 2020-09-16 00:00:00, dtype: float64

In [34]:
df.loc['2020-09-15',['A']]

A   -0.1011
Name: 2020-09-15 00:00:00, dtype: float64

iloc 속성

    -loc와 달리 행과 열의 번호를 이용하여 데이터 활용

In [35]:
df.iloc[[0,1],[0,1]]

                   A         B
2020-09-15 -0.101100 -0.566769
2020-09-16  0.793045  0.526989

In [36]:
df2 = df.copy()
df2

                   A         B         C         D
2020-09-15 -0.101100 -0.566769  1.338602 -0.729187
2020-09-16  0.793045  0.526989  0.194956 -1.353654
2020-09-17  1.890562  0.975485  0.303967  0.261831
2020-09-18 -0.322551  0.756119 -0.592289 -1.676248
2020-09-19  0.654654  0.274811 -0.888663 -2.792851
2020-09-20 -1.564976 -0.808252 -1.424122 -0.499903

In [37]:
df.iloc[0,0]

-0.10110029911221297

In [38]:
df.iloc[0,0] = 10

df

                    A         B         C         D
2020-09-15  10.000000 -0.566769  1.338602 -0.729187
2020-09-16   0.793045  0.526989  0.194956 -1.353654
2020-09-17   1.890562  0.975485  0.303967  0.261831
2020-09-18  -0.322551  0.756119 -0.592289 -1.676248
2020-09-19   0.654654  0.274811 -0.888663 -2.792851
2020-09-20  -1.564976 -0.808252 -1.424122 -0.499903

In [39]:
#영향 안받는다.

df2

                   A         B         C         D
2020-09-15 -0.101100 -0.566769  1.338602 -0.729187
2020-09-16  0.793045  0.526989  0.194956 -1.353654
2020-09-17  1.890562  0.975485  0.303967  0.261831
2020-09-18 -0.322551  0.756119 -0.592289 -1.676248
2020-09-19  0.654654  0.274811 -0.888663 -2.792851
2020-09-20 -1.564976 -0.808252 -1.424122 -0.499903

In [40]:
# 이미 존재하는 DataFrame에 새로운 column 추가

df['E'] = [1,2,3,4,5,6]

df

                    A         B         C         D  E
2020-09-15  10.000000 -0.566769  1.338602 -0.729187  1
2020-09-16   0.793045  0.526989  0.194956 -1.353654  2
2020-09-17   1.890562  0.975485  0.303967  0.261831  3
2020-09-18  -0.322551  0.756119 -0.592289 -1.676248  4
2020-09-19   0.654654  0.274811 -0.888663 -2.792851  5
2020-09-20  -1.564976 -0.808252 -1.424122 -0.499903  6

In [41]:
# 존재하는 컬럼 삭제(Search)

del df['E']

df

                    A         B         C         D
2020-09-15  10.000000 -0.566769  1.338602 -0.729187
2020-09-16   0.793045  0.526989  0.194956 -1.353654
2020-09-17   1.890562  0.975485  0.303967  0.261831
2020-09-18  -0.322551  0.756119 -0.592289 -1.676248
2020-09-19   0.654654  0.274811 -0.888663 -2.792851
2020-09-20  -1.564976 -0.808252 -1.424122 -0.499903

In [42]:
df['E'] =[1,2,3,np.nan,5,6]

df

                    A         B         C         D    E
2020-09-15  10.000000 -0.566769  1.338602 -0.729187  1.0
2020-09-16   0.793045  0.526989  0.194956 -1.353654  2.0
2020-09-17   1.890562  0.975485  0.303967  0.261831  3.0
2020-09-18  -0.322551  0.756119 -0.592289 -1.676248  NaN
2020-09-19   0.654654  0.274811 -0.888663 -2.792851  5.0
2020-09-20  -1.564976 -0.808252 -1.424122 -0.499903  6.0

In [43]:
# 해당 컬럼에 데이터 존재 여부 확인 - isin

df['E'].isin([1,3,5,7])

2020-09-15     True
2020-09-16    False
2020-09-17     True
2020-09-18    False
2020-09-19     True
2020-09-20    False
Freq: D, Name: E, dtype: bool

In [44]:
df[3:4]=4
df

                    A         B         C         D    E
2020-09-15  10.000000 -0.566769  1.338602 -0.729187  1.0
2020-09-16   0.793045  0.526989  0.194956 -1.353654  2.0
2020-09-17   1.890562  0.975485  0.303967  0.261831  3.0
2020-09-18   4.000000  4.000000  4.000000  4.000000  4.0
2020-09-19   0.654654  0.274811 -0.888663 -2.792851  5.0
2020-09-20  -1.564976 -0.808252 -1.424122 -0.499903  6.0

In [45]:
del df['np.nan']

df

KeyError: 'np.nan'

In [ ]:
df2 = df['E'].fillna('4')
df2

In [ ]:
df

In [ ]:
df['E'].min()

In [ ]:
df['E'].max()

In [ ]:
df['E'].max() - df['E'].min()

이미 존재하는 파일의 내용을 기반으로 DataFrame 생성하기

In [ ]:
df = pd.read_csv('0.dataSet/friends.csv')

df

In [ ]:
type(df)

In [ ]:
df['이름']

In [ ]:
df['나이']

In [ ]:
df.loc[3,'이름'] = '이순'
df

In [ ]:
df['이름'][3]= '서은수'
df

In [ ]:
df['이름'][3]='이순'
df

In [ ]:
# tab으로 구분된 데이터 read해서 DataFrame 생성하기

#read_csv() & 구분자 필요(함수의 속성 사용)

df = pd.read_csv('0.dataSet/friendsTab.txt', delimiter = "\t")

df

In [ ]:
df = pd.read_csv('0.dataSet/friendsTab.txt')

df

In [ ]:
df = pd.read_csv('0.dataSet/friendsTab.txt')

df

In [ ]:
df = pd.read_csv('0.dataSet/friendsTabNoHead.txt')

df

In [ ]:
#컬럼명을 명시적ㅇ로 적용 & 데이터는 row영역으로 재정렬

#컬럼 추가


df.columns = ['name','age', 'job', 'hobby']

df

In [ ]:
#step02 - column 으로 사용된 data 손실을 방지를 위한 설정 

df = pd.read_csv('0.dataSet/friendsTabNoHead.txt', delimiter = "\t", header = None)

df.columns = ['name','age', 'job', 'hobby']

df

In [ ]:
#step03

df = pd.read_csv('0.dataSet/friendsTabNoHead.txt', delimiter = "\t", 
                 header=None, names=['name','age', 'job', 'hobby'])

df

In [50]:
#? salary 추가, 데이터 0으로 채우기
df['salary']=0

df

                    A         B         C         D    E  salary
2020-09-15  10.000000 -0.566769  1.338602 -0.729187  1.0       0
2020-09-16   0.793045  0.526989  0.194956 -1.353654  2.0       0
2020-09-17   1.890562  0.975485  0.303967  0.261831  3.0       0
2020-09-18   4.000000  4.000000  4.000000  4.000000  4.0       0
2020-09-19   0.654654  0.274811 -0.888663 -2.792851  5.0       0
2020-09-20  -1.564976 -0.808252 -1.424122 -0.499903  6.0       0

In [52]:
# job이 학생인 경우엔 salary 값이 no, 학생이 아닌 경우엔 yes 대입

#np.where() - 조거식 적용 가능한 함수

# 조건식 : df['job'] != '학생'  , df['job'] == '학생' no

df['salary'] = np.where(df['job'] != '학생', 'yes', 'no')

df

KeyError: 'job'

In [53]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'}]

type(friend_dict_list)

list

In [54]:
type(friend_dict_list[0])

dict

In [55]:
friend_dict_list[0]

{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}

In [56]:
friend_dict_list[0]['name']

'신동엽'

In [57]:
#? friend_dict_list 순수 파이썬 데이터로 DataFrame 객체로 생성해 주기
df = pd.DataFrame(friend_dict_list)

df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [58]:
# 컬럼 순서 변경

df = df[ ['hobby','job','name','age'] ]

df

   hobby  job name  age
0  music  연예인  신동엽   20
1    art   교수  유재석   41
2  study   학생  김새롬   18
3   talk  상담사  이영자   45
4   talk  연예인  강호동   38

중복 데이터 제거 기술

In [62]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'} ]

In [63]:
df = pd.DataFrame(friend_dict_list)

df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [64]:
# 중복 데이터 삭제 : 이미 존재하는 데이터와 중복되는 
df = df.drop_duplicates()

df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [65]:
#step02 - 속성으로 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)

df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [66]:
df = df.drop_duplicates(keep = 'last')

df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [67]:
# step03 - 동명이인일 경우에 선별해서 삭제


friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [73]:
# df = df.drop_duplicates(['name'],keep = 'last')

df = df.drop_duplicates('name',keep = 'last')

df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [75]:
#step04 - 원본 DataFrame 자체에 수정 사항 바로 반영하는 속성

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'} ]


df = pd.DataFrame(friend_dict_list)

In [107]:
df = df.drop_duplicates('name', keep='last', inplace=True)

df

AttributeError: 'NoneType' object has no attribute 'drop_duplicates'

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   job     6 non-null      object
 3   hobby   6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

결측시 처리

In [82]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)

df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   job     6 non-null      object
 3   hobby   6 non-null      object
dtypes: float64(1), object(3)
memory usage: 320.0+ bytes

In [84]:
#? 결측치 확인 함수 - True/False isna() & isnull()로 검색
df.isna()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [86]:
df['age'].sum()

162.0

In [87]:
df['age'].mean()

32.4

In [88]:
df['age'].fillna(0)

df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [ ]:
#DB의 내장 함수들 처럼 null 즉 결측치를 제외하고 연산 진행
df['age'].mean()

In [89]:
#? 생성된 DataFrame의 재대입 없이 현 dataframe 값이 수정되게 속성 추가하기

df['age'].fillna(0,inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   0.0  연예인  music

In [90]:
v = df.groupby('job')
v

In [92]:
print(len(v))
print(v.groups)

4
{'교수': Int64Index([1], dtype='int64'), '상담사': Int64Index([3], dtype='int64'), '연예인': Int64Index([0, 4, 5], dtype='int64'), '학생': Int64Index([2], dtype='int64')}

In [93]:
v['age']

In [98]:
#job 별 age의 중앙값(중위수)으로 변환

df.groupby("job")['age'].transform('median')

0    20.0
1    41.0
2    18.0
3    45.0
4    20.0
5    20.0
Name: age, dtype: float64

In [105]:
#? 원본에 DataFrame이 수정되도록 개선

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)

df['age'] = df.groupby("job")['age'].transform('median')

df

  name   age  job  hobby
0  신동엽  29.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  29.0  연예인   talk
5  신동엽  29.0  연예인  music

In [110]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'},
                     {'name': '고현정', 'age': 44, 'job': '가수', 'hobby':'music'},
                     {'name': '박민영', 'age': 22, 'job': '학생', 'hobby':'art'},
                     {'name': '박서준', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '박보검', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '이효리', 'age' : 28, 'job' : '교수', 'hobby' : 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby':'music'}]

df = pd.DataFrame(friend_dict_list)

df

   name   age  job  hobby
0   신동엽  20.0  연예인  music
1   유재석  41.0   교수    art
2   김새롬  18.0   학생  study
3   이영자  45.0  상담사   talk
4   강호동  38.0  연예인   talk
5   신동엽   NaN  연예인  music
6   고현정  44.0   가수  music
7   박민영  22.0   학생    art
8   박서준  18.0   학생  study
9   박보검  45.0  상담사   talk
10  이효리  28.0   교수   talk
11  이상순  29.0   주부  music

In [113]:
print(df.job)
print(df.job.unique()) # distinct와 흡사

0     연예인
1      교수
2      학생
3     상담사
4     연예인
5     연예인
6      가수
7      학생
8      학생
9     상담사
10     교수
11     주부
Name: job, dtype: object
['연예인' '교수' '학생' '상담사' '가수' '주부']

In [116]:
print(df.job.unique())

print(df.job.value_counts()) #job 별 count

['연예인' '교수' '학생' '상담사' '가수' '주부']
연예인    3
학생     3
교수     2
상담사    2
가수     1
주부     1
Name: job, dtype: int64

In [122]:
#? hobby 종류 별의 개수 출력
print(df.hobby.unique()) #hobby 종류 확인

print(df.hobby.value_counts()) #hobby 종류의 수 확인

['music' 'art' 'study' 'talk']
talk     4
music    4
art      2
study    2
Name: hobby, dtype: int64

In [123]:
print(len(df.hobby.unique()))

4

In [124]:

l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

print(df1)
print(df2)

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자
  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [125]:
df1

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자

In [127]:
df3 = [df1, df2]

df3

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,
   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [128]:
print(type(df3))

print(type(df2))

<class 'list'>
<class 'pandas.core.frame.DataFrame'>

In [129]:
df3[0]

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자

In [130]:
type(df3[0])

pandas.core.frame.DataFrame

In [133]:
# df1과 df2를 병합해서 dataframe 생성

#ignore_index=True 설정으로 새로운 index 적용
df4 = pd.concat(df3, ignore_index=True)

type(df4)

pandas.core.frame.DataFrame

In [134]:
df4

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인

In [136]:
l1

[{'name': '이효리', 'job': '교수'},
 {'name': '이상순', 'job': '학생'},
 {'name': '박보검', 'job': '개발자'}]

In [137]:
l2

[{'name': '신동엽', 'job': '치과의사'},
 {'name': '이영자', 'job': '농부'},
 {'name': '정찬우', 'job': '연예인'}]

In [138]:
df1

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자

In [139]:
df2

  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [142]:
type(df3)

#가로


df5 = pd.concat(df3, axis = 1, ignore_index=True)

df5

     0    1    2     3
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [143]:
#세로 

df6 = pd.concat(df3, axis = 0, ignore_index=True)

df6

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인